Repository: arjun-dureja/SubWidget
Catalog: SubWidgetIntents/*.lproj/Localizable.strings
Languages: ar, de, es, hi, pt_br, ta

source: 1 Hour
ar: 1 ساعة
de: 1 Stunde
es: 1 Hora
hi: 1 घंटा
pt_br: 1 Hora
ta: 1 மணி

source: 6 Hours
ar: 6 ساعات
de: 6 Stunden
es: 6 Horas
hi: 6 घंटे
pt_br: 6 Horas
ta: 6 மணி

source: 12 Hours
ar: 12 ساعة
de: 12 Stunden
es: 12 Horas
hi: 12 घंटे
pt_br: 12 Horas
ta: 12 மணி

source: 30 Minutes
ar: 30 دقيقة
de: 30 Minuten
es: 30 Minutos
hi: 30 मिनट
pt_br: 30 Minutos
ta: 30 நிமிடங்கள்

source: Currently, you can add up to 10 channels. If you would like to add more, please contact me using the link in Settings and I will increase the limit.
ar: حاليًا، يمكنك إضافة ما يصل إلى 10 قنوات. إذا كنت ترغب في إضافة المزيد، يرجى الاتصال بي باستخدام الرابط في الإعدادات وسأزيد الحد.
de: Zurzeit können Sie bis zu 10 Kanäle hinzufügen. Wenn Sie mehr hinzufügen möchten, kontaktieren Sie mich bitte über den Link in den Einstellungen und ich werde das Limit erhöhen.
es: Actualmente, puedes agregar hasta 10 canales. Si deseas agregar más, por favor contáctame usando el enlace en Configuración y aumentaré el límite.
hi: वर्तमान में, आप अधिकतम 10 चैनल जोड़ सकते हैं। यदि आप और अधिक जोड़ना चाहते हैं, तो कृपया सेटिंग्स में दिए गए लिंक का उपयोग करके मुझसे संपर्क करें और मैं सीमा बढ़ा दूंगा।
pt_br: Atualmente, você pode adicionar até 10 canais. Se quiser adicionar mais, por favor, entre em contato comigo usando o link em Configurações e eu aumentarei o limite.
ta: தற்போது, நீங்கள் 10 சேனல்கள் வரை சேர்க்கலாம். நீங்கள் மேலும் சேர்க்க விரும்பினால், அமைப்புகளில் உள்ள இணைப்பைப் பயன்படுத்தி என்னை தொடர்பு கொள்ளவும், நான் வரம்பை அதிகரிக்கிறேன்.

source: First, tap and hold on your Lock Screen and tap 'Customize'. Then you can add the widget and tap it to select the channel.
ar: أولاً، انقر واستمر في الضغط على شاشة القفل الخاصة بك وانقر على 'تخصيص'. بعد ذلك، يمكنك إضافة الواجهة والنقر عليها لتحديد القناة.
de: Zuerst tippen und halten Sie auf Ihrem Sperrbildschirm und tippen Sie auf 'Anpassen'. Dann können Sie das Widget hinzufügen und darauf tippen, um den Kanal auszuwählen.
es: Primero, toca y mantén presionado en tu pantalla de bloqueo y toca 'Personalizar'. Luego puedes agregar el widget y tocarlo para seleccionar el canal.
hi: सबसे पहले, अपनी लॉक स्क्रीन पर टैप करके रखें और 'कस्टमाइज़' पर टैप करें। फिर आप विजेट जोड़ सकते हैं और उसे टैप करके चैनल चुन सकते हैं।
pt_br: Primeiro, toque e segure na sua Tela de Bloqueio e toque em 'Personalizar'. Depois, você pode adicionar o widget e tocar nele para selecionar o canal.
ta: முதலில், உங்கள் பூட்டு திரையில் தட்டி அழுத்தி 'விருப்பமைக்கவும்' என்று தட்டவும். பின்னர் நீங்கள் விஜெட்டைச் சேர்க்கலாம் மற்றும் சேனலைத் தெரிவு செய்ய அதை தட்டலாம்.

source: How do I add the widget to my homescreen?
ar: كيف أضيف الواجهة إلى شاشتي الرئيسية؟
de: Wie füge ich das Widget zu meinem Startbildschirm hinzu?
es: ¿Cómo agrego el widget a mi pantalla de inicio?
hi: मैं अपनी होमस्क्रीन पर विजेट कैसे जोड़ूं?
pt_br: Como adiciono o widget à minha tela inicial?
ta: என் முகப்புத் திரையில் விஜெட்டை எப்படி சேர்க்கலாம்?

source: How do I add widget to my Lock Screen?
ar: كيف أضيف واجهة إلى شاشة القفل الخاصة بي؟
de: Wie füge ich ein Widget zu meinem Sperrbildschirm hinzu?
es: ¿Cómo agrego el widget a mi pantalla de bloqueo?
hi: मैं अपनी लॉक स्क्रीन पर विजेट कैसे जोड़ूं?
pt_br: Como adiciono o widget à minha Tela de Bloqueio?
ta: என் பூட்டு திரையில் விஜெட்டை எப்படி சேர்க்கலாம்?

source: How many channels can I add?
ar: كم عدد القنوات التي يمكنني إضافتها؟
de: Wie viele Kanäle kann ich hinzufügen?
es: ¿Cuántos canales puedo agregar?
hi: मैं कितने चैनल जोड़ सकता हूँ?
pt_br: Quantos canais posso adicionar?
ta: நான் எத்தனை சேனல்களை சேர்க்கலாம்?

source: How often does the subscriber count update?
ar: كم مرة يتم تحديث عدد المشتركين؟
de: Wie oft wird die Abonnentenzahl aktualisiert?
es: ¿Con qué frecuencia se actualiza el contador de suscriptores?
hi: सब्सक्राइबर काउंट कितनी बार अपडेट होता है?
pt_br: Com que frequência a contagem de inscritos é atualizada?
ta: சந்தாதாரர் எண்ணிக்கை எவ்வளவு அடிக்கடி புதுப்பிக்கப்படுகிறது?

source: I can't find my channel.
ar: لا أستطيع العثور على قناتي.
de: Ich kann meinen Kanal nicht finden.
es: No puedo encontrar mi canal.
hi: मुझे अपना चैनल नहीं मिल रहा है।
pt_br: Não consigo encontrar meu canal.
ta: எனது சேனலை கண்டுபிடிக்க முடியவில்லை.

source: I have a feature idea I want to request.
ar: لدي فكرة ميزة أريد طلبها.
de: Ich habe eine Idee für eine Funktion, die ich anfragen möchte.
es: Tengo una idea de función que quiero solicitar.
hi: मेरे पास एक फीचर आइडिया है जिसे मैं अनुरोध करना चाहता हूँ।
pt_br: Eu tenho uma ideia de recurso que quero solicitar.
ta: நான் கேட்க விரும்பும் ஒரு அம்ச யோசனை உள்ளது.

source: Please remove the widget from your homescreen and add it back.
ar: يرجى إزالة الواجهة من الشاشة الرئيسية وإضافتها مرة أخرى.
de: Bitte entfernen Sie das Widget von Ihrem Startbildschirm und fügen Sie es wieder hinzu.
es: Por favor, quita el widget de tu pantalla de inicio y vuelve a agregarlo.
hi: कृपया अपनी होमस्क्रीन से विजेट को हटा दें और उसे फिर से जोड़ें।
pt_br: Por favor, remova o widget da sua tela inicial e adicione-o novamente.
ta: தயவுசெய்து உங்கள் முகப்புத் திரையிலிருந்து விஜெட்டை நீக்கி மீண்டும் சேர்க்கவும்.

source: Restores the widget's colors to the defaults.
ar: استعادة ألوان الواجهة إلى الإعدادات الافتراضية.
de: Stellt die Standardfarben des Widgets wieder her.
es: Restablece los colores del widget a los predeterminados.
hi: विजेट के रंगों को डिफ़ॉल्ट में पुनर्स्थापित करता है।
pt_br: Restaura as cores do widget para os padrões.
ta: விஜெட்டின் நிறங்களை இயல்புநிலைக்கு மீட்டமைக்கிறது.

source: Tap and hold anywhere on your homescreen and tap the plus button in the top left. Look for SubWidget and add it to your homescreen. Finally, tap and hold on the widget and select your channel.
ar: انقر واستمر في الضغط في أي مكان على شاشتك الرئيسية وانقر على زر الإضافة في الجزء العلوي الأيسر. ابحث عن الواجهة الفرعية وأضفها إلى شاشتك الرئيسية. أخيرًا، انقر واستمر في الضغط على الواجهة وحدد قناتك.
de: Tippen und halten Sie an einer beliebigen Stelle auf Ihrem Startbildschirm und tippen Sie auf die Plus-Schaltfläche oben links. Suchen Sie nach SubWidget und fügen Sie es Ihrem Startbildschirm hinzu. Tippen und halten Sie schließlich auf das Widget und wählen Sie Ihren Kanal aus.
es: Toca y mantén presionado en cualquier lugar de tu pantalla de inicio y toca el botón más en la parte superior izquierda. Busca SubWidget y agrégalo a tu pantalla de inicio. Finalmente, toca y mantén presionado el widget y selecciona tu canal.
hi: अपनी होमस्क्रीन पर कहीं भी टैप करके रखें और ऊपर बाईं ओर प्लस बटन पर टैप करें। SubWidget को खोजें और उसे अपनी होमस्क्रीन पर जोड़ें। अंत में, विजेट पर टैप करके रखें और अपना चैनल चुनें।
pt_br: Toque e segure em qualquer lugar na sua tela inicial e toque no botão de mais no canto superior esquerdo. Procure por SubWidget e adicione-o à sua tela inicial. Por fim, toque e segure no widget e selecione seu canal.
ta: உங்கள் முகப்புத் திரையில் எங்கும் தட்டி அழுத்தி, மேல் இடதுபுறத்தில் உள்ள பிளஸ் பட்டனை தட்டவும். SubWidget ஐத் தேடி உங்கள் முகப்புத் திரையில் சேர்க்கவும். இறுதியாக, விஜெட்டின் மீது தட்டி அழுத்தி உங்கள் சேனலைத் தெரிவு செய்க.

source: The channels aren't loading.
ar: القنوات لا تتحمل.
de: Die Kanäle werden nicht geladen.
es: Los canales no se están cargando.
hi: चैनल लोड नहीं हो रहे हैं।
pt_br: Os canais não estão carregando.
ta: சேனல்கள் ஏற்றப்படவில்லை.

source: The widget is blank.
ar: الواجهة فارغة.
de: Das Widget ist leer.
es: El widget está en blanco.
hi: विजेट खाली है।
pt_br: O widget está em branco.
ta: விஜெட்டு காலியாக உள்ளது.

source: This indicates a server issue. Please try again later.
ar: هذا يشير إلى مشكلة في الخادم. يرجى المحاولة مرة أخرى لاحقًا.
de: Dies deutet auf ein Serverproblem hin. Bitte versuchen Sie es später noch einmal.
es: Esto indica un problema con el servidor. Por favor, inténtalo de nuevo más tarde.
hi: यह एक सर्वर समस्या को दर्शाता है। कृपया बाद में पुनः प्रयास करें।
pt_br: Isso indica um problema no servidor. Por favor, tente novamente mais tarde.
ta: இது ஒரு சேவையக சிக்கலை குறிக்கிறது. தயவுசெய்து பின்னர் முயற்சிக்கவும்.

source: Try entering your channel ID instead of your channel name. If that still doesn't work, please contact me and I will help you.
ar: حاول إدخال معرّف قناتك بدلاً من اسم قناتك. إذا لم ينجح ذلك، يرجى الاتصال بي وسأساعدك.
de: Versuchen Sie, Ihre Kanal-ID anstelle Ihres Kanalnamens einzugeben. Wenn das immer noch nicht funktioniert, kontaktieren Sie mich bitte und ich werde Ihnen helfen.
es: Intenta ingresar el ID de tu canal en lugar del nombre de tu canal. Si eso aún no funciona, por favor contáctame y te ayudaré.
hi: अपने चैनल के नाम के बजाय अपनी चैनल आईडी दर्ज करने का प्रयास करें। यदि वह अभी भी काम नहीं करता है, तो कृपया मुझसे संपर्क करें और मैं आपकी मदद करूंगा।
pt_br: Tente inserir o ID do seu canal em vez do nome do seu canal. Se isso ainda não funcionar, por favor, entre em contato comigo e eu o ajudarei.
ta: உங்கள் சேனல் பெயருக்கு பதிலாக உங்கள் சேனல் ஐடியை உள்ளிட முயற்சிக்கவும். அதுவும் செயல்படவில்லை என்றால், தயவுசெய்து என்னை தொடர்பு கொள்ளவும், நான் உதவுவேன்.

source: Unfortunately, YouTube does not provide exact subscriber counts, they provide a rounded number.
ar: للأسف، يوتيوب لا يوفر عدد المشتركين الدقيق، بل يوفر رقمًا مقربًا.
de: Leider gibt YouTube keine genauen Abonnentenzahlen an, sie geben eine gerundete Zahl an.
es: Lamentablemente, YouTube no proporciona conteos exactos de suscriptores, proporciona un número redondeado.
hi: दुर्भाग्यवश, YouTube सटीक सब्सक्राइबर गिनती प्रदान नहीं करता है, वे एक गोल नंबर प्रदान करते हैं।
pt_br: Infelizmente, o YouTube não fornece contagens exatas de inscritos, eles fornecem um número arredondado.
ta: துரதிருஷ்டவசமாக, YouTube குறிப்பிட்ட சந்தாதாரர் எண்ணிக்கையை வழங்காமல், ஒரு சுற்று எண்ணை வழங்குகிறது.

source: What does the reset button do?
ar: ماذا يفعل زر إعادة الضبط؟
de: Was macht der Zurücksetzen-Button?
es: ¿Qué hace el botón de reinicio?
hi: रीसेट बटन क्या करता है?
pt_br: O que o botão de reset faz?
ta: மீட்டமைப்பு பொத்தான் என்ன செய்கிறது?

source: Why doesn't it show the exact subscriber count?
ar: لماذا لا يظهر عدد المشتركين الدقيق؟
de: Warum zeigt es nicht die genaue Abonnentenzahl an?
es: ¿Por qué no muestra el conteo exacto de suscriptores?
hi: यह सटीक सब्सक्राइबर गिनती क्यों नहीं दिखाता है?
pt_br: Por que não mostra a contagem exata de inscritos?
ta: ஏன் அது குறிப்பிட்ட சந்தாதாரர் எண்ணிக்கையை காட்டவில்லை?

source: You can request a feature using the Wishlist tab below.
ar: يمكنك طلب ميزة باستخدام علامة التبويب قائمة الرغبات أدناه.
de: Sie können eine Funktion anfordern, indem Sie die Registerkarte Wunschliste unten verwenden.
es: Puedes solicitar una función usando la pestaña de Lista de deseos a continuación.
hi: आप नीचे दिए गए विशलिस्ट टैब का उपयोग करके एक फीचर का अनुरोध कर सकते हैं।
pt_br: Você pode solicitar um recurso usando a aba Lista de Desejos abaixo.
ta: நீங்கள் கீழே உள்ள Wishlist தாவலைப் பயன்படுத்தி ஒரு அம்சத்தை கோரலாம்.

source: You can select how often you want the widget to update in the app settings. The minimum is every 30 minutes.
ar: يمكنك تحديد مدى تكرار تحديث الواجهة في إعدادات التطبيق. الحد الأدنى هو كل 30 دقيقة.
de: Sie können auswählen, wie oft das Widget in den App-Einstellungen aktualisiert werden soll. Das Minimum ist alle 30 Minuten.
es: Puedes seleccionar con qué frecuencia deseas que el widget se actualice en la configuración de la aplicación. El mínimo es cada 30 minutos.
hi: आप ऐप सेटिंग्स में विजेट को कितनी बार अपडेट करना चाहते हैं, यह चुन सकते हैं। न्यूनतम हर 30 मिनट है।
pt_br: Você pode selecionar com que frequência deseja que o widget seja atualizado nas configurações do aplicativo. O mínimo é a cada 30 minutos.
ta: நீங்கள் செயலி அமைப்புகளில் விஜெட்டு எவ்வளவு அடிக்கடி புதுப்பிக்கப்பட வேண்டும் என்பதை தெரிவு செய்யலாம். குறைந்தபட்சம் ஒவ்வொரு 30 நிமிடங்களுக்கும் உள்ளது.
